/*
 * @Author: WouRaoyu
 * @Date: 2021-04-24 20:31:09
 * @LastEditors: Lincong-pro
 * @LastEditTime: 2023-04-20 15:17:46
 * @Description: file content
 */
const MenusInfo = {
  清理场景: {
    viewPnt: {
      Orientation: {
        heading: 0.4877452913349529,
        pitch: -0.12890153648127423,
        roll: 0.001371713534783936,
      },
      Position: {
        longitude: 101.7953831,
        latitude: 29.9689476,
        height: 5268.1536498,
      },
    },
    layers: ['基础影像'],
  },
  大渡河: {
    viewPnt: {
      Orientation: {
        heading: 6.276850450003431,
        pitch: -0.35478442331601645,
        roll: 6.283165706080862,
      },
      Position: {
        longitude: 102.2318959,
        latitude: 29.9104429,
        height: 2283.1830672,
      },
    },
    layers: ['基础影像', 'DOM_大渡河_低精度', 'DEM-0.2m', 'DOM_大渡河_高精度', '基础施工辅助设施', '下部结构', '上部结构', '附属设施'],
  },
  康定: {
    viewPnt: {
      Orientation: {
        heading: 5.848107619933472,
        pitch: -0.5514402480161209,
        roll: 6.281746510019346,
      },
      Position: {
        longitude: 101.88355063024079,
        latitude: 29.988837146640755,
        height: 3459.566006529713,
      },
    },
    layers: ['DEM', '基础影像', '正洞DSM_0415', '隧道设计模型'],
  },
  //康定二号隧道数据
  正洞工区: {
    viewPnt: {
      Orientation: {
        heading: 5.848107619933472,
        pitch: -0.5514402480161209,
        roll: 6.281746510019346,
      },
      Position: {
        longitude: 101.88355063024079,
        latitude: 29.988837146640755,
        height: 3459.566006529713,
      },
    },
    layers: ['DEM', '基础影像', '正洞DSM_0415'],
  },
  斜井工区: {
    viewPnt: {
      Orientation: {
        heading: 4.745275002117658,
        pitch: -0.620412507120101,
        roll: 6.279615185059718,
      },
      Position: {
        longitude: 101.83386921099783,
        latitude: 30.04354120794573,
        height: 4216.301997166297,
      },
    },
    layers: ['DEM', '基础影像', '斜井DSM_0106'],
  },
  横洞工区: {
    viewPnt: {
      Orientation: {
        heading: 4.892427943022785,
        pitch: -0.3486747979722955,
        roll: 6.280145998854772,
      },
      Position: {
        longitude: 101.87238799771075,
        latitude: 29.986263433533246,
        height: 3354.321793899783,
      },
    },
    layers: ['DEM', '基础影像', '正洞DSM_0415'],
  },
  地质情况: {
    viewPnt: {
      Orientation: {
        heading: 0.4877452913349529,
        pitch: -0.12890153648127423,
        roll: 0.001371713534783936,
      },
      Position: {
        longitude: 101.7953831,
        latitude: 29.9689476,
        height: 5268.1536498,
      },
    },
    layers: ['基础影像', '地质文字标注', '地质体_剖面1右部分', '地质体_剖面2右部分'],
  },
};

const DZInfo = {
  ZDClipLine: [
    101.8780173, 29.9930645, 3267.16, 101.8792882, 29.9937276, 3204.25, 101.8811336, 29.99303, 3210.96, 101.8878452, 29.9929649, 3194.1, 101.887532,
    29.989903, 3199.45, 101.8784218, 29.9908171, 3211.6,
  ],
  DZClipLine: [
    101.778577, 30.0360071, 3556.6, 101.7864728, 30.0321497, 3470.37, 101.7908095, 30.0300559, 3468.31, 101.7944573, 30.0282611, 3455.49, 101.8147485,
    30.0183258, 3385.86, 101.8274632, 30.0121154, 3343.86, 101.8432057, 30.0044189, 3299.06, 101.850831, 30.0006779, 3285.78, 101.8524338, 29.9999358,
    3293.72, 101.85941, 29.9973628, 3283.61, 101.8640209, 29.995663, 3272.32, 101.8682741, 29.9945453, 3254.13, 101.87295, 29.9933564, 3208.95,
    101.8788558, 29.992398, 3177.48,
  ],
};

export { MenusInfo, DZInfo };
