const fullLineFault = [
  {
    name: '巴青-类乌齐断裂',
    position: [96.3969532275, 31.2259632214],
  },
  {
    name: '班公错--怒江断裂',
    position: [96.507181174, 30.432256647],
  },
  {
    name: '崩错-怒江断裂',
    position: [97.04605395, 30.6108112],
  },
  {
    name: '日土-丁青断裂',
    position: [97.2676711, 30.00192198],
  },
  {
    name: '察雅东-盐井断裂',
    position: [98.05152159, 30.33340047],
  },
  {
    name: '达机翁-朗县断裂',
    position: [94.8523394, 29.49993354],
  },
  {
    name: '札达-邛多断裂',
    position: [95.29190241, 28.95662236],
  },
  {
    name: '达吉岭-仁布断裂',
    position: [95.19854837, 29.36205863],
  },
  {
    name: '嘉黎-然乌断裂',
    position: [94.87114857, 30.22150893],
  },
  {
    name: '空喀拉--澜沧江断裂带',
    position: [97.35710778, 30.73887857],
  },
  {
    name: '空隆格尔-纳木错-仲沙断裂',
    position: [96.18982832, 30.12102735],
  },
  {
    name: '洛扎-错那断裂',
    position: [94.62456935, 28.76907075],
  },
];

const scFault = [
  {
    name: '大雪山－农戈山断裂',
    position: [101.737997, 30.39787482],
  },
  {
    name: '三合断裂',
    position: [102.5533214, 29.78003894],
  },
];

const xzFault = [
  {
    name: '鲁拿打断层',
    position: [94.77556561, 29.67071988],
  },
  {
    name: '夺松-比丁断裂',
    position: [94.21820759, 29.56726954],
  },
];
export { fullLineFault, scFault, xzFault };
